user-4.1/tutorials/surfaceTracking/newInterFreeFoam/capillarity2D/Allrun
#!/bin/sh

. $WM_PROJECT_DIR/bin/tools/RunFunctions

application="newInterFreeFoam"

runApplication makeFaMesh
runApplication $application
