user-4.1/tutorials/surfaceTracking/newInterFreeFoam/capillarity2D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

applicationClass    newInterFreeFoam;

startFrom           latestTime;

startTime           0;

stopAt              endTime;

endTime             10;

deltaT              0.01;

writeControl        runTime;

writeInterval       0.05;

cycleWrite          0;

writeFormat         ascii;

writeCompression    compressed;

timeFormat          general;

timePrecision       6;

runTimeModifiable   yes;

//functions
//(
//   history
//   {
//       type sloshingHistory;
//       functionObjectLibs
//       (
//         "libsloshingHistory.so"
//       );
//   }
//);

// ************************************************************************* //

